import {
  Carousel,
  CarouselContent,
  CarouselItem,
  CarouselNext,
  CarouselPrevious,
} from "../ui/carousel";

const uvod = [
  "Модерни путнички обрасци ступали су у наше крајеве постепено и са значајним закашњењем у односу на већи део Европе. Па ипак, подручја која је насељавао српски народ, била су већ посредно укључена у путничку револуцију. Наиме, главни актериовог историјског преображаја, путници из најразвијенијих и најмоћнијих земаља Европе, увелико су крстарили балканским путевима.",
  "Европски намерници долазили су на Балканско полуострво и у претходним вековима. Ходочасници и крсташки витезови, гласници и велетрговци, посећивали су српске земље још током средњег века, па и у доба турске владавине. Ипак, током XIX столећа, захваљујући појави удобних речних пароброда и незаустављивом ширењу железничке мреже, број страних путника, заинтересованих да посете тајанствене и неоткривене балканске пределе, почео је значајно да се повећава. Крајем века, успостављањем сталне железничке линије између Париза и Истанбула и ширењем културе путних бедекера, занимање за путовање на југоисток Европе чувеним Оријент експресом зачело се чак и код оних Европљана који нису припадали највишим друштвеним слојевима.",
  "Мотиви путника новог доба показивали су све мање заједничких спона са поривима хришћанских поклоника из претходних епоха. Иако су ходочасници,трговци и дипломате пристизали на наше просторе чак и у већој мери него раније, XIX век је обележио нови тип европских путника. То су били путници-истраживачи, који су у походе кретали превасходно из научних побуда, ради потраге за споменицима прохујалих времена и обичајима народа које је историја привремено заборавила. Како су деценије протицале, њима су се неминовно придружили и они који су путовали из пуке знатижеље или у потрази за авантуром. Њихово поимање путовања, било је ослобођено страха и немира које су осећали путници током претходних столећа. Самоуверени Европљани XIX века, весници индустријске цивилизације и прогреса, све ређе су зазирали од путовања у непознато. Такође, много чешће, они су писали свеобухватне и детаљне белешке о својим путовањима, чији је језик, у складу са императивом епохе, тежио научности, или је пак имитирао научни стил.",
  "Ипак, за нас је најважније да њихови путнички извештаји из XIX века, по први пут после више векова, помињу Србе као предмет свог интересовања, а не само као забелешку на маргинама путописа о Европској Турској. Они су заиста, без претеривања, Европу упознали са Србијом и српским народом. Слика коју су стварали о нашој земљи 37 и становништву, била је сложена. На првом месту она је била одређена објективним околностима живота српског народа, које су имали прилику да упознају. Па ипак, оно што су видели и доживели, странци су неминовно у својим описима, свесно или несвесно, провлачили кроз сито својих културних предубеђења о заосталом и инертном Оријенту или дивљем, граничарском Балкану. Осим тога, уколико су путници били уједно и посланици европских држава, њихови закључци о Србима и српској држави били су очекивано обликовани у складу са интересима њихових влада. Ако су се пак у Србију упутили ради самосталног истраживања, њихове путне забелешке бивале су у већој мери везане за њихове личне доживљаје, али и политичка и филозофска уверења. Коначно, оне су могле бити и плод склоности појединих писаца-путника ка фантастичним и пустоловним дескрипцијама. У зависности од тога који је од ових стваралачких елемената доминирао њиховим делима, она су у већој мери сведочила о самим ауторима, њиховим културама и рачунима њихових земаља према Србији или су пак представљала релативно веродостојне извештаје о српском становништву и земљи.",
  "Слика српског народа у путописима странаца, из вековима пажљиво негованих европских представа о бајковитом Оријенту, пробијала се у више праваца. На првом месту, ови списи су се током XIX века постепено претварали у сведочанства о тешким условима живота Срба и других хришћана под османском влашћу. Истовремено, они су представљали саставе о изазовима са којима су се сирови и необразовани, али јуначни и поносни Срби суочавали у процесу изградње државе и друштва по узорима европских установа, грађанске културе и индустријализоване привреде. Најзад, странци су значајне делове својих списа умели да посвете дивљењу споменицима српске средњовековне материјалне културе, а многи међу њима високо су ценили и народну епску традицију и историјска предања нашег народа.",
];

function Uvod() {
  return (
    <Carousel className="flex w-[80rem] h-[50rem] mt-[5rem] items-center text-justify px-[4rem] text-[1.7rem]">
      <CarouselContent>
        {uvod.map((item, index) => (
          <CarouselItem className="" key={index}>
            {item}
          </CarouselItem>
        ))}
      </CarouselContent>

      <CarouselPrevious />
      <CarouselNext />
    </Carousel>
  );
}

export default Uvod;
