import {
  Carousel,
  CarouselContent,
  CarouselItem,
  CarouselNext,
  CarouselPrevious,
} from "@/components/ui/carousel";

const gradanskaKutura = [
  "Путописци који су нашим крајевима крстарили током 20-их и 30-их година XIX века, видели су, у начину живота српског становништва у градовима, још увек  приметне обрасце сеоске патријархалне културе. Како је забележио Ото Дубислав Пирх: „Када кажете трговцу у дућану да бисте желели да му упознате кућу и породицу, то он оставља радњу калфи (...) и води вас у унутрашњост поменутих простора. У лепом предсобљу или у кујни, која се бели као снег, дочекује вас домаћица. Затим се улази у собу. Прво се изводе деца, затим се показује намештај па после домаћин седа са гостима за један сто. Жена доноси ритопечког вина, воћа и слатка (...). Што је посета дужа, то је домаћин веселији и срдачнији.”",
  "Међутим, како су године пролазиле, промене у начину живота и понашањудруштвене елите постајале су све приметније, како у самој Србији, тако и у околним регијама. Већ 50-их година, руски конзул Гиљфердинг приметио је међу босанским Србима да се део становништва по богатству и манирима све више разликовао од остатка народа. То су били богати сарајевски трговци: „Православни грађани трговци  створили су касту, и њих покреће само лични и кастински егоизам. Најбогатији сарајевски капиталиста, (...) мисли да је велики друштвени добротвор ако сваке године жртвује 50 рубаља за црквену касу. (...) Читава ова трговачка каста у суштини је само ћифта и ситничар. Сељацима они не продају готово ништа јер се сељаци сами хране и  одевају (...) Уколико сељак више осиромаши, утолико ће се од њега моћи повољније купити жито, кожа, вуна и сл. (...) Само једном годишње се Сарајлија разулари: на своје крсно име (...) када се, по српском обичају, празнује светитељ заштитник рода и дома. На славу се позива цео свет. Гости по турски прекрсте ноге и (седају) уз ниске столове. (...) Овчетина и пита играју главну улогу у гозби. (...) Пије се у здравље сваког госта. Здравице се пропраћају поздравима и жељама (...) редовно у епском, често врло лепом  облику. Пије се до изнемоглости. (...) После богате гозбе, мушкарци, заносећи при ходу, одлазе да виде коло које воде девојке и младе жене.”",
  "Током друге половине столећа, друштвене промене су постале све видљивије и у Србији. Како у погледу животних навика, тако и својим облачењем и културним стремљењима, житељи српских вароши све више су се угледали на узоре Беча, Париза и других европских градова. Како је то почетком 40-их година предвиђао Ендру Пејтон, „Сеоско становништво Србије мора неизбежно да напредује споро, али за сваких пет година, (...), не сумњам у то, измениће се изглед градског становништва.”",
  "Неколико деценија касније, овај процес је већ значајно узнапредовао. Када је аустријски путописац Франц Шерер посетио Београд, 1882. године, приметио је огромне промене: „Не само да се град као такав променио (...), но су и људи који живе у овом граду постали (...) потпуно други људи! Где су нестали сви они весели људи у њиховим шареним националним костимима, са блиставим оружјем о појасу и њиховим обичним, неусиљеним кретањем улицом? (...) Само сеоско становништво које се види на градским улицама подсећа странца својом сликовитом ношњом и својим неусиљеним међусобним понашањем (...), на некадашњу хваљену земљу опште равноправности и братства. (...) Златно старо време очигледно заувек је прошло, и модерне социјалне супротности (...) излазе на површину и подсећају да ново време настаје и у Србији.”",
  "Као и обично, овај процес најпотпуније је описао Феликс Каниц: „У поподневним и вечерњим часовима у главним улицама које воде на Калемегдан влада живост каква је раније била непозната. Женски свет блиста у хаљинама најновијег париског кроја (...). Код мушкараца се потпуно губи раније тако честа полуоријентална ношња; плаво и бело морнарско одело преовлађује код дечака; западни шешир најразличитијих облика већ је однео превагу над муслиманским фесом, а на људе који га носе, (...) гледа се као на прилике из праисторијског времена. (...) Мушки монденски свет чине кицоши из богатијих кућа, који с висине гледају на свет око себе, затим укусно униформисани официри и млади дипломати обучени по последњој париској моди, који већином станују у Гранд-хотелу или у хотелу Империјал и снобовски воде конверзацију на страним језицима ,и то прилично гласно.”",
  "Каниц је нагласио како је „ера материјалног успона”, за српску престоницу, наступила у доба изградње железнице: „Заводљиви пример (...) француских предузимача и одважних пројектаната, који су, (...) често и последњи свој наполеон олако трошили у скупим хотелима који су ницали као гљиве после кише, и (...) западна мода, која је са свих страна продирала, поткопавали су незадрживо старе навике и обичаје, који су и иначе већ били начети. Убрзо је и некада конзервативни Београђанин почео да увиђа да пиво Гамбринус, које је брзо освајало терен, боље прија у друштву и под отвореним небом. Ницале су многе велике кафанске баште (...); према бечким и пештанским узорима уређивани су забавни локали, а све већи хотели су претварали своја дворишта у неку врсту оперетских сцена са најшаренијим програмима. (...) У Њујорку, Славији, код Коларца, Руског цара и у многим другим локалима владао је увече прави урнебес.",
  "Људи су најрадије јели бечке шницле, печено пиле, мађарски гулаш и уз то раздрагано клицали певачима француских шансона, (...) чешким акробатама, немачким јолдашицама, који су сви били неуморни у скраћивању времена и пражњењу новчаника. (...) Склоност западњачком начину одевања и живота и извесном луксузу у уређењу станова, (...) је захватила већ и ниже друштвене слојеве. Ова се тежња већином задовољава увезеним пештанским и бечким, на жалост често аљкаво рађеним намештајем, завесама од јуте и теписима који су јефтини, али не тако лепи и трајни као домаћи пиротски ћилими. Међутим, има већ и кућа чије се уређење и намештај одликују таквим пробраним укусом и истинском раскоши да би чинили част свакој изложби.”",
  "Ипак, једна ствар је подсећала Каница на стару српску народну културу: „Највећи породични празник је у Београду, као и на селу, крсна слава. (...) У двору, у кући министра, професора, банкара, официра, адвоката и лекара, као и у кући најскромнијег трговчића и занатлије, посетиоцима који дођу да честитају славу служе се за добродошлицу слатко и кафа – из више или мање луксузних шољица. Крштење и свадба, празници и постови славе се према ритуалу који прописују традиционални обичаји.”",
];

function GradanskaKutura() {
  return (
    <Carousel className="flex w-[55rem] h-[30rem] mt-[5rem] items-center text-justify px-[4rem] text-[1.2rem] ">
      <CarouselContent>
        {gradanskaKutura.map((item, index) => (
          <CarouselItem className="" key={index}>
            {item}
          </CarouselItem>
        ))}
      </CarouselContent>

      <CarouselPrevious />
      <CarouselNext />
    </Carousel>
  );
}

export default GradanskaKutura;
