import {
  Carousel,
  CarouselContent,
  CarouselItem,
  CarouselNext,
  CarouselPrevious,
} from "@/components/ui/carousel";

const tradicionalnaKultura = [
  "Међу путним забелешкама Европљана који су током XIX века обилазили наше крајеве, могуће је уочити три различита вида перцепције балканских народа, који су се често мешали и прожимали. Најпре, као народи прелазне регије, житељи Балкана су били увек у процесу развоја, полуцивилизовани или полуоријентални. Осим тога, они су припадали специфичној култури граничара. Били су неуглађени, непросвећени, сујеверни, окрутни и склони разбојништву. Како је то у случају српског народа описао француски посланик, Боа ле Конт: „У сваког народа, у кога образованост још није могла ублажити оштрину карактера (...), наћи ћете у дну нарави и осионости, па и дивљине у навикама, наћи ћете наклоности к отмичарству, к злоупотреби јаких пића, к лењости (...). Ни Срби нису без тих порока.”",
  "Међутим, за романтичарски настројене путнике из привредно најразвијенијих земаља Европе, Балкан је током XIX столећа постао и својеврстан прозор у средњи век. Они су на нашим просторима трагали за Европом каква је некад била. Стога су становници Балкана у њиховим списима били представљени као једноставни, скромни и храбри људи, у чијим заједницама је и даље владала патријархална култура и племенска демократија. Како је записао Херберт Вивијен, Срби су били „дивни људи из доба витештва”, снажни, згодни, гостољубиви, весели и сујеверни, „као да још увек живе у средњем веку”. На сличан начин, британски авантуриста Чарлс Џејмс Лемб описао је Његошеве Црногорце, које је упознао 1843. године: „Смели су, одважни и слободни, склони пљачкашким препадима и жељни окршаја.”",
  "Најсликовитији опис карактера српског народа оставио је, ипак, британски дипломата Ендру Пејтон почетком 40-их година: „Србин веома личи на шкотског брђанина. Храбар је у боју, веома гостољубив; ужива у тужној, једноставној музици и поезији, a омиљени инструмент су му гајде и виолина. За разлику од Грка, показује мало способности за трговину, а за разлику од Бугарина, врло је лењ као пољопривредник. Све то одговара шкотском келтском карактеру; (...) Хајдуци (...), којих су у првој четвртини века шуме Србије биле пуне, личили су на катеране из шкотских брда – били су исто толико бунтовници колико разбојници, и мислили су да пркосећи власти не поступају нечасно јер се боре за принцип независности. Пљачкали су само богате муслимане и често су били дарежљиви према сиротињи. (...) Сигуран сам да би авантуре неког српског Роба Роја биле добар материјал за један авантуристички роман.”",
  "Европски путописци са посебном пажњом проучавали су патријархалне обрасце живота српског друштва. Испред свега, били су заинтересовани за институцију задружне породице. У њој су видели не само установу породичне економије, већ и чувара традиције и идентитета српског народа под вишевековном туђинском влашћу. Најбољи опис типичне српске задруге дело је Феликса Каница, у чијем је делу приказан живот породице Недић, која је живела у селу Десићу, близу Шапца: „Кућни ред је патријархалан, али старешину ипак ограничавају права осталих чланова задруге. Ако умре отац, (...), за старешину се бира обично најспособнији члан задруге; ако се он покаже недорастао, приступа се новом избору. Старешина заступа задругу пред политичким властима, решава све спорове и води послове куће у којима учествују сви чланови. Одрасли мушкарци и жене раде у пољу и шуми, млађи чувају стоку и наизменично иду у школу.”",
  "Део описа, Каниц је посветио и положају и улози жене у задружном домаћинству: „Жена у Србији учествује, раме уз раме с мушкарцем, готово у свим пословима. Никад она није докона, увек је запослена. Кад се врати с тешког посла у пољу, она преде, че, пере, бели и боји тканине за рубље и одећу. Имућност или вршење материнских дужности не смањују готово нимало те обавезе. Српска жена је у просеку преданија послу од мушкарца, који не крије да воли удобност и доколицу.”",
  "Свеукупно пак он је врло повољно оценио модел српске задружне породице: „Може ли статистичар (...) изразити благодат која улази у кућу тиме што деца могу на бакином крилу да слушају породична предања, (а) стари људи у истим просторијама у којима су провели своју младост доживљавају ведре дане у кругу својих унука и праунука.” Он је искрено жалио што је заједништво задруге временом посустајало пред неизбежним друштвеним променама: „И, невероватно: у брдима се често наилази на породице које живе у већем благостању него оне у равници; тамо се, наиме, још држи кућна задруга у којој сви чланови породице, укључујући и оне ожењених синова, сложно запињу у борби с природом, док доле у Морави сваки дан све више хвата маха разједињујући индивидуализам.”",
  "У сржи патријархалног начина живота српског народа, путописци су проналазили древне обичаје, попут крсне славе, а посебан значај су поклањали богатом историјском предању. Управо у овим одликама традиционалне културе, они су видели изворе виталности српског народа, како у прошлим, тако и у будућим временима. Како су у свом делу из 60-их година забележиле Мис Ирби и Џорџина Мјур Мекензи: „Битка косовска била је она у којој се последњи цар српски сукоби с муслиманским непријатељем земље своје, и успомена на њу тако је жива остала, да путник тешко може говорити дуже од неколико минута с правим каквим Србином а да не чује име Косова. (...) Скупљајући се о својим празницима испод зидова својих великих цркава,(хришћани) имају за се сва предања старе царевине.”",
  "На сличан начин, о српском историјском предању, писао је и руски посланик у Османском царству, Александар Гиљфердинг: „Православни Србин, ма где он живео – у Босни, Херцеговини, Далмацији, Угарској, Кнежевини Србији – има, сем цркве, једну велику домовину, српску земљу, истина подељену између многих господара, али она постоји идеално (...) Он има своје усмено предање, традицију: зна за српског светитеља Саву, за српског цара Душана за српског мученика Лазара, за јунака Краљевића Марка.”",
  "На значај усменог предања у српском породичном животу осврнуо се и Каниц, на растанку са породицом Недић: „(Старешина) ће дохватити са зида гусле и њихов једноличан тон ће одјекнути у пространој одаји; за легендама ће доћи јуначке песме, у којима се потресно прича о некадашњим недаћама отаџбине и величају њене борбе за ослобођење. Тако кућа старешине постаје пријатно зборно место целе породице. Крај његовог огњишта се буди и развија љубав појединаца према националним традицијама и распаљује њихово одушевљење за слободу и отаџбину.”",
];

function TradicionalnaKultura() {
  return (
    <Carousel className="flex w-[55rem] h-[30rem] mt-[5rem] items-center text-justify px-[4rem] text-[1.2rem] ">
      <CarouselContent>
        {tradicionalnaKultura.map((item, index) => (
          <CarouselItem className="" key={index}>
            {item}
          </CarouselItem>
        ))}
      </CarouselContent>

      <CarouselPrevious />
      <CarouselNext />
    </Carousel>
  );
}

export default TradicionalnaKultura;
