import {
  Carousel,
  CarouselContent,
  CarouselItem,
  CarouselNext,
  CarouselPrevious,
} from "@/components/ui/carousel";

const uvod = [
  "Незаобилазну тему у делима европских путописаца чинили су и становници Балкана. Са великом посвећеношћу, они су истраживали њихову културу и бележили своје утиске о обичајима, карактеру и менталитету народа који су живели „на прагу Оријента”. Када би писали о Србима, њихову пажњу је најпре заокупљала традиционална култура житеља мале, „подунавске кнежевине и потоње краљевине”. Међутим, поједини аутори су умели да значајне делове својих списа посвете и примерима стварања модерних културних образаца, на које су наилазили у српским градовима у другој половини века.",
  "Такође, европски путници били су више него свесни да је велики део српског народа током XIX века живео ван граница Србије. Они су о Србима писали и када би се запутили у брда и кланце „слободне Црне Горе”, а повремено би их приметили и у крајевима Хабзбуршке монархије. Обилазећи неослобођене крајеве Босанског пашалука и Старе Србије, најчешће су писали о проблемима хришћана под дотрајалом османском влашћу. Па ипак, чак и у овим списима, било је повремено места за описе вековима чуваних народних обичаја и предања српског народа.",
];

function Uvod() {
  return (
    <Carousel className="flex w-[80rem] h-[50rem] mt-[5rem] items-center text-justify px-[4rem] text-[1.7rem] ">
      <CarouselContent>
        {uvod.map((item, index) => (
          <CarouselItem className="" key={index}>
            {item}
          </CarouselItem>
        ))}
      </CarouselContent>

      <CarouselPrevious />
      <CarouselNext />
    </Carousel>
  );
}

export default Uvod;
