import {
  Carousel,
  CarouselContent,
  CarouselItem,
  CarouselNext,
  CarouselPrevious,
} from "@/components/ui/carousel";

const arhitektutra = [
  "Мотив „мешања цивилизација”, у делима европских путописаца, посебно је долазио до изражаја у случају описа српских градова. Најбољи пример био је свакако Београд, који је за већину странаца представљао почетну станицу на походу кроз Србију. Тако је аустријски писац Сигфрид Капер, који је младу кнежевину посетио 1850. године, записао: „Овде се додирује историја (Османлија) која сада своје последње улоге одиграва (...) (и) она друга, која тек ступа у круг светских догађаја. На Београду се види да је то варош где се додирују умирање и поновно оживљавање, пропаст и подизање, прошлост и будућност. (...) Уз стари застој примећује се нови напредак.” На сличан начин, писао је и британски пастор Вилијам Дентон, када је 1862. године доспео у српску престоницу: „Јединствена мешавина оријенталног и западног живота појавила се преда мном. Многе сцене и звуци су ме уверавали да нисам у потпуно муслиманској земљи, (али) мешали су се са другим, који су ми говорили да сам на предстражи Турске империје.”",
  "Па ипак, као и у претходним случајевима, путници који су Србију посећивали током друге половине века, у већој мери су акцентовали напредак у модернизацији. Ово је нарочито видљиво у Каницовом делу. Он је истакао да се Београд преображава по узору на Беч: „Царски Беч је постао идеја водиља за балканске градове. Идући за примером Беча, и Београд је хтео, пошто су Турци 1867. године отишли, да добије свој кружни булевар са широким скверовима, еспланадама итд. (...) Али већ и природним, постепеним развитком (...) уклањањем ружног шанца и турских махала, регулацијом улица и улепшавањем онога што је остало новоградњама, парковима, тротоарима (...), уклоњени су последњи остаци из оног времена када је шаролика мешавина оријенталних и западњачких елемената подстицала живу игру маште.” Насупрот томе, појавили су се „зграда Народне банке (...), која би чинила украс сваком велеграду” и „низ кућа у Дубровачкој улици, украшених каријатидама, стубовима, калканима, мансардама, куполама и малим кулама на угловима”.",
  "На сличан начин, крајем века, о Београду је писао и Херберт Вивијен: „Заиста, Београд је, у суштини, модеран, скоро западни град; и они који траже обележја његове историјске прошлости тражиће узалуд. Тврђава, неколико чесама са турским натписима и руинирани лук звани Цариградска капија су једини прави остаци исламске владавине.”",
  "Године 1905, Београд је посетио новинар и писац Хари де Винт (Harry de Windt), који је у српској престоници већ једном боравио, 1876. године. Он је истакао како је, тридесет година раније, ово био суморан, примитиван и прљав град, неудобан за живот. Стога је био очаран променама које је запазио. Није било више „прашњавих и блатњавих улица”, а градом су доминирали „дуги и широки булевари, препуни луксузних кола”. Модерни Београд био је по његовом суду највидљивији на Теразијама, где су се налазиле елегантне зграде, сјајни хотели и луксузне куће, као и осветљене продавнице.",
];

function ArhitekturaPrestolnice() {
  return (
    <Carousel className="flex w-[80rem] h-[50rem] mt-[5rem] items-center text-justify px-[4rem] text-[1.7rem] ">
      <CarouselContent>
        {arhitektutra.map((item, index) => (
          <CarouselItem className="" key={index}>
            {item}
          </CarouselItem>
        ))}
      </CarouselContent>

      <CarouselPrevious />
      <CarouselNext />
    </Carousel>
  );
}

export default ArhitekturaPrestolnice;
