import {
  Carousel,
  CarouselContent,
  CarouselItem,
  CarouselNext,
  CarouselPrevious,
} from "@/components/ui/carousel";

const drzavno = [
  "Сходно идеји о балканској „међупросторности”, путописним приказивањем Србије током XIX века доминирала су два карактеристична типа представе. На првом месту, она је била земља „мешовите културе” и „цивилизацијских супротности”, која постепено превазилази наслеђе „османске провинције” и развија се у правцу европских узора. Почетак овог процеса, пруски официр Ото Дубислав Пирх, који је посетио младу кнежевину 1829. године, описао је на следећи начин: „Доба у коме се Србија налази (...) то је доба биљке која се развија, доба детета које (...) баца своје погледе на свет (...) и почиње да везује с тим извесне појмове”.",
  "Истовремено пак, Србија је била и „егалитарни рај” западних романтичара. Разочарани ликом модерне индустријске цивилизације, они су на Балкану трагали за измаштаним врлинама скромности, једноставности и племенитости. Космополита и путописац, Ами Буе, који је у нашој земљи боравио током 30-их година, закључио је да је српска држава најближа „идеалној монархији без двора”, са институцијама „најприближнијим републиканским”. На њеном челу, видео је кнеза Милоша, који је на  њега оставио утисак „праведног и доброг паше”, али и „принца- грађанина”. Писао је да је Милоша „обожавао цео народ и поштовао га због његове особености, а никако због (...) титула, богатства или блештавог окружења”.",
  "Мотиви „цивилизацијске двојности” и „прелаза између различитих епоха историјског развитка” – били су доминантни у описима српског политичког живота и у потоњим деценијама. Најбољи пример пружио је британски дипломата, Ендру Пејтон,  који се у Србији затекао почетком 40-их година, у доба смене на престолу и успостављања власти Уставобранитеља. Оценивши укидање апсолутизма кнеза Милоша као корак унапред у модернизацији земље, он је ипак уочио да у српском чиновништву и даље постоје како „источне”, тако и „западне” форме: „Погледајте неког начелника у забитом крају, шћућуреног на дивану (...) како пуши лулу и слуша садржај документа који му чита његов секретар, чучећи или клечећи на тепиху, и ето пред вама бега, кајмакама или мутеселима. Погледајте г. Петронијевића како пише у свом кабинету, е ето вам (...) Conferenz Minister-a из Саксоније или Хесеа.”",
  "Током друге половине века, тонови модернизације и „европеизације”, постепено су преузимали примат у делима страних путописаца о Србији. Ово се посебно могло уочити у делу чувеног аустријског путописца и „одушевљеног балканолога”, Феликса Каница, који је нашу земљу пропутовао у више наврата, од 50-их до 90-их година XIX века. Као преломно раздобље у процесу прихватања европских тековина у Србији, у најширем смислу, он је означио период друге владавине кнеза Михаила, који је „неуморним радом за добро народа, несумњиво заслужио мање трагичан крај”. По његовом суду, српска кнежевина је управо тада учинила крупан корак у приближавању „цивилизованој Европи” и, истовремено, постала најзначајнији чинилац на Балкану.",
  "Током последњих деценија века, након успостављања парламентаризма у земљи, актуелна тема страних путописа постао је и српски партијски живот. Енглески путописац Херберт Вивијен поредио је 90-их година српске политичке странке и њихове предводнике са узорима из Британије. Тако су га, на пример, либерали Јована Ристића подсетили на британске виговце, а њихов лидер на „типичног Енглеза” са зулуфима једног лорда, који у Србији жели да успостави „олигархију, венецијанског типа”. С друге стране, Каница је више занимао изглед српског партијског живота на локалном плану. Посведочио је о необично узаврелим страстима српске партијске политике, али и о ендемској појави локалних моћника, који су се у својим областима понашали као „мали деспоти”. Сматрао је да „страначке борбе раздиру целу земљу”, те да је једна од њихових последица било „котеријаштво, које је (...) неретко доводило и  до (...) убистава”. „У (..) либералској кафани Златни крст, узалуд ћете тражити (...) напредњачки лист”, написао је, „а ако какав неискусан продавац листа Видело залута у ову кафану, сигурно ће бити дочекан с подсмехом или презиром.”",
  "Међутим, трагични догађаји из 1903. године учинили су да углед српске државе у европској јавности готово преко ноћи буде значајно погоршан. Ово се осетило у наредним годинама и у путописној литератури. Тако је британска археолошкиња Идит Дарам, у својим потоњим делима, драму Мајског преврата употребила да припише кривицу Србији за готово све проблеме који су постојали на Балкану. Такође, британски репортер Реџиналд Ранкин посетио је Београд 1912. године, током Првог балканског рата, између осталог и да би описао двор у коме је краљевски пар страдао: „Када се погледа са улице, палата делује модерно и цивилизовано, али се унутар њених зидова десило убиство које подсећа на најкрвавија раздобља средњовековне историје.”",
];

function DrzavnoUredenje() {
  return (
    <Carousel className="flex w-[55rem] h-[30rem] mt-[5rem] items-center text-justify px-[4rem] text-[1.2rem] ">
      <CarouselContent>
        {drzavno.map((item, index) => (
          <CarouselItem className="" key={index}>
            {item}
          </CarouselItem>
        ))}
      </CarouselContent>

      <CarouselPrevious />
      <CarouselNext />
    </Carousel>
  );
}

export default DrzavnoUredenje;
