import {
  Carousel,
  CarouselContent,
  CarouselItem,
  CarouselNext,
  CarouselPrevious,
} from "@/components/ui/carousel";

const privredni = [
  "Међу страним путописцима XIX века владало је готово једнодушно уверење о баснословним природним богатствима Србије. Ово је најпре било видљиво код француских писаца. Тако су Ламартин и Франсис Евре 30-их година писали о српским „океанима шума”, док је Боа ле Конт забележио како су дебели слојеви плодне и „масне земље” и „умерени нагиб планина” у Србији створили идеалне услове за развој пољопривреде. Још један посетилац из Француске, Адолф Жером Бланки, пружио је још потпунији опис природних и, посебно, рудних потенцијала наше земље, када је 40-их година посетио српску кнежевину: „Нема земље, природом богатије и згодније удешене, шумом и ораницом (...) сретније измешане. Хоћу само да напоменем долину Пека (...) која би се (својим рудним богатствима) могла сравнити са Лиманом и Грезиводаном у Француској.” На крају, треба поменути и сликовити опис енглеско путописца, Едмунда Спенсера, који је 50-их година забележио како би српска „плодна поља”, ако би се ваљано обрађивала, могла постати прави „златни рудници”.",
  "Насупрот оваквим утисцима, посетивши и осмотривши наша села и градове, страни путници неминовно су долазили до закључка да је већи део српског становништва живео крајње скромно. Романтичарски настројени путописци, попут Херберта Вивијена, били су склони да у овоме пронађу доказ самодовољности српског сељака, који не чезне за луксузом: „Велика већина (људи) живи на земљи, на мање или више патријархалан начин, обезбеђујући довољно за све (...) потребе средствима здравог рада у пољу (...) Сиромаштво је практично непознато.” С друге стране, Феликс Каниц је у скромним условима живота српског народа и у неискоришћености природних потенцијала њихове отаџбине, видео ништа друго до заоставштину владавине Османског царства, чија је тиранија гушила предузимачки дух њених поданика. Описујући рудна богатства Пека, он пише да је „овако важан извор материјалног богатства могла занемарити само нехатна турска власт (јер је) његово искоришћавање (...) захтевало нешто више памети и рада, него просто пљачкање раје.”",
  "С тим у вези, Каниц је више него иједан други писац настојао да покаже како се Србија, након добијања самоуправе, отиснула на пут постепеног, али незадрживог напретка: „За младу Србију је зора препорода почела тек пре неколико деценија.  Путник без предрасуда видеће тамо у свакој клици и најмањег напретка наговештај и јемство једне лепше будућности.” У складу са овом темељном идејом, он је, обилазећи Србију изнова, из деценије у деценију, неуморно трагао за доказима процвата и модернизације српске пољопривреде, радиности и индустрије, као и развоја просвете, саобраћаја и градске архитектуре.",
  "Уочио је како је у Гружи и Книћу у другој половини века, „захваљујући благотворном утицају железнице” процветало шљиварство. Такође, пажљиво је посматрао успон текстилне индустрије у Параћину и око Лесковца. Са задовољством је описао процват земљорадње и сточарства у Свилајнцу и Рађевини, а значајне делове своје обимне студије, посветио је и развоју рудника у Мајданпеку, као и Тополивнице и других индустријских постројења у Крагујевцу. Хвалио је подухвате кнеза Михаила у циљу унапређења изгледа Буковичке бање, а за Зајечар је установио да је 90-их година XIX века био најразвијенији град краљевине, после Београда. Честа су била и његова поређења са европским и америчким „примерима прогреса”, па је тако похвалио „јенкијевски дух” Јагодинаца, због њихове склоности ка путовању и трговини. Нису му промакли ни похвални примери предузимљивости у производњи качкаваља на Ракошу, и ћилима у Пироту. Као посебно велики значај истакао је развој школства у регијама које су се граничиле са Османским царством. Тако је, крајем века, новоотворену школу у варошици Рашкој описао као „последњи расадник европске цивилизације, до залива Арте у Грчкој”.",
];

function PrivredniRazvoj() {
  return (
    <Carousel className="flex w-[80rem] h-[50rem] mt-[5rem] items-center text-justify px-[4rem] text-[1.7rem] ">
      <CarouselContent>
        {privredni.map((item, index) => (
          <CarouselItem className="" key={index}>
            {item}
          </CarouselItem>
        ))}
      </CarouselContent>

      <CarouselPrevious />
      <CarouselNext />
    </Carousel>
  );
}

export default PrivredniRazvoj;
