import {
  Carousel,
  CarouselContent,
  CarouselItem,
  CarouselNext,
  CarouselPrevious,
} from "@/components/ui/carousel";

const uvod = [
  "Тегобни животни услови српског народа под османском влашћу били су главни предмет забелешки странаца који су током XIX века обилазили неослобођене крајеве Косова и Метохије, Старе Рашке, Херцеговине и Босне. Међутим, када би ступали на тло „слободне” Србије, фокус њиховог приповедања померао се ка другим темама. Као средишњи мотив „путничких црта”, које су писали, наметала се идеја „откривања” једне нове земље „на размеђу цивилизација”.",
  "За британске авантуристе, попут Кинглејка или Џулије Пардоу, Дунав и Сава су током 30-их година још увек представљали границу између „Европе која користи кочије” и где је „све у покрету” и „пустоши Истока”, где је над „мрачним утврђењима (...) лебдела мртва тишина”. Ипак, стварањем првих хришћанских држава на Балкану, гранични појас између „учмалог Oријента” и „динамичног Oксидента” у делима страних путника, почео је постепено да се шири. Овај простор попуњавала је нова творевина западне путописне географије, балканска „гранична или прелазна регија” (borderlands). Као њен саставни део, Србија коју су сликали путописци издвајала се полако из уобразиље Оријента, али је то није нужно чинило делом „модерне Европе”. Напротив, њене политичке установе и њен друштвени и привредни живот били су интегрални део описа „међупростора” или „моста”, који је спајао различите цивилизације, али и „историјске епохе”.",
];

function Uvod() {
  return (
    <Carousel className="flex w-[80rem] h-[50rem] mt-[5rem] items-center text-justify px-[4rem] text-[1.7rem]">
      <CarouselContent>
        {uvod.map((item, index) => (
          <CarouselItem className="" key={index}>
            {item}
          </CarouselItem>
        ))}
      </CarouselContent>

      <CarouselPrevious />
      <CarouselNext />
    </Carousel>
  );
}

export default Uvod;
